{
  "rng": {
    "low": [
      "${playerName}'s RNG is at a measly ${rng}%${dropString}! Even Jerry has better luck!",
      "Ouch! ${playerName}'s luck${dropString} just hit rock bottom at ${rng}%. Time to pet some black cats for good measure!",
      "${playerName}'s RNG${dropString} is so low (${rng}%), they might actually have a chance at winning a 'Worst Luck' competition!",
      "${playerName} stumbled upon a cursed RNG scroll${dropString}. It reads: '${rng}% chance'. Yikes, maybe it's time to stop hopping!",
      "${playerName}'s RNG${dropString} is at ${rng}%. Even a Zombie Villager would feel sorry for them!",
      "With ${rng}% RNG${dropString}, ${playerName} might as well try fishing in the Void.",
      "${playerName} rolled a ${rng}%${dropString}. Time to change their IGN to 'Unlucky${PlayerName}'!",
      "${playerName}'s luck${dropString} bottomed out at ${rng}%. Did they anger RNGesus by killing Jerries?"
    ],
    "medium": [
      "${playerName}'s RNG stands at a solid ${rng}%${dropString}. Not great, not terrible, just like their skill average!",
      "The RNG gods grant ${playerName} a lukewarm ${rng}%${dropString}. Perfectly balanced, as all things should be... except the Skyblock economy.",
      "Breaking news: ${playerName}'s luck meter${dropString} shows a steady ${rng}%! Time to buy a lottery ticket... in Monopoly!",
      "${playerName}'s RNG${dropString} is ${rng}%! That's like finding a Smite VI ... from a Revenant.",
      "${playerName}'s RNG${dropString} sits at ${rng}%. As average as a non-upgraded Aspect of the Void.",
      "With ${rng}% luck${dropString}, ${playerName} is as middle-of-the-road as Hub island.",
      "${rng}% RNG for ${playerName}${dropString}. Not great, not terrible, just like Superior Dragon Armor."
    ],
    "high": [
      "Holy! ${playerName}'s RNG just skyrocketed to ${rng}%${dropString}! Time to fight some Inquisitors while blindfolded!",
      "RNGesus shouts: ${playerName}, your chances${dropString} are ${rng}%!' Even Dante's statue is jumping for joy!",
      "${playerName} just broke the RNG-o-meter with a whopping ${rng}%${dropString}! That's higher than the chances of finding a lobby without beggars!",
      "${playerName}'s RNG${dropString} skyrocketed to ${rng}%! Time to fight Necron with an Aspect of the Jerry!",
      "With ${rng}% luck${dropString}, ${playerName} could probably find Necron's Handle in the first run!",
      "${playerName} just hit ${rng}% RNG${dropString}! They should try using Wheel of Fate, it might turn into a godroll!"
    ]
  },
  "cf": {
    "heads": [
      "${playerName} flipped Heads! Looks like RNGesus took a coffee break for this one.",
      "The coin speaks to ${playerName}: Heads! More reliable than Bazaar flipping, eh?",
      "${playerName}'s coin said Heads! If only dungeon runs were this predictable...",
      "Heads up, ${playerName}! You're officially ahead of the game now!",
      "The coin says Heads to ${playerName}! If only dungeon runs were this consistent.",
      "Heads up, ${playerName}! Now if only they could 'head up' to Catacombs 50 this easily."
    ],
    "tails": [
      "${playerName}'s coin flip resulted in Tails. Plot twist: it was a Bonzo Coin all along!",
      "Tails for ${playerName}! Still easier than flipping items on auction house.",
      "The cosmic coin toss for ${playerName} reveals: Tails! More suspenseful than waiting for Diana's event!",
      "Tails never fails for ${playerName}! Unless you're trying to get a Warden Helm, then it always fails.",
      "${playerName}'s coin shows Tails! Unlike the party finder, this result didn't disappoint.",
      "It's Tails, ${playerName}! More unexpected than finding out there's no RNG in RNGesus drops."
    ]
  },
  "throw": {
    "low": [
      "${playerName} threw the run ${throwIntensity}%! That's less tragic than losing 12 coin to a Gaia Construct.",
      "${playerName}'s throw skills: ${throwIntensity}%. Barely noticeable, like using Juju Shortbow in Dragon fights... wait, that's actually okay!",
      "${playerName}'s throw was only ${throwIntensity}%! They're more stable than Skyblock's economy!",
      "A mere ${throwIntensity}% throw from ${playerName}! They're more reliable than finding good teammates in Party Finder.",
      "${playerName} threw ${throwIntensity}%! That's less noticeable than the difference between Heroic AOTV and Warped AOTV!"
    ],
    "medium": [
      "${playerName} threw the run with ${throwIntensity}% intensity! That's like forgetting to equip the right power stone... again.",
      "Alert: ${playerName} just threw harder than a Marina simp throws money at Shark Bait! Throw level: ${throwIntensity}%",
      "${playerName} threw the run ${throwIntensity}%! That's about as bad as using Livid Dagger in Master Mode Floor 3!",
      "${playerName}'s throw skills: ${throwIntensity}%. Comparable to using a Hyperion as a melee weapon!",
      "${playerName} achieved a ${throwIntensity}% throw! As middling as using a Golem Sword in Floor 7.",
      "${playerName}'s throw: ${throwIntensity}%. Not great, not terrible, just like using a Juju Shortbow in Master Mode.",
      "Throw level for ${playerName}: ${throwIntensity}%. As average as the IQ of a Hub 1 Lowballer."
    ],
    "high": [
      "${playerName} threw the run with a devastating ${throwIntensity}% intensity! That's like dying to a T1 Rev while wearing Necron armor.",
      "DEFCON 1 ALERT: ${playerName} just threw harder than Hypixel's servers during update releases! Throw level: ${throwIntensity}%",
      "${playerName} threw the run ${throwIntensity}%! That's more tragic than accidentally salvaging a Hyperion!",
      "${playerName}'s throw was so bad (${throwIntensity}%), even Watchdog got confused and banned a cheater!",
      "${playerName}'s ${throwIntensity}% throw was so bad, even Bonzo is facepalming!",
      "With a ${throwIntensity}% throw, ${playerName} just redefined the term 'skill issue'.",
      "${playerName}'s throw was ${throwIntensity}%! They're now the official mascot for 'How Not to Play Skyblock'."
    ]
  },
  "dice": {
    "low": [
      "${playerName} rolled a ${result}! That's ${result} more than their chances of dropping a Necron's Handle!",
      "The dice whisper to ${playerName}: ${result}! Still higher than the chances of getting a good random in F7!",
      "${playerName} shakes the dice and gets a ${result}. Wow, same as their brain cells during a Kuudra fight!",
      "${playerName} rolls a ${result}. That's the same number of times they've touched grass this month!",
      "The dice whispers ${result} to ${playerName}. Even Jerrys have better luck!",
      "${playerName} got a ${result}. That's how many brain cells they have left after grinding Skills for 48 hours straight!"
    ],
    "medium": [
      "Dice roll for ${playerName}: ${result}! Coincidentally, that's also how many attempts it took them to beat Entrance Floor!",
      "${playerName}'s dice said ${result}! Higher than their skill average, at least.",
      "The RNG gods granted ${playerName} a ${result}. Still better odds than getting superior from dragons!",
      "${playerName} rolled ${result}. That's how many years it'll take for them to afford a Terminator at this rate!",
      "Dice result for ${playerName}: ${result}. Perfectly balanced, unlike Skyblock's economy!",
      "${playerName}'s roll: ${result}. Not great, not terrible, just like their skill average.",
      "${playerName} got a ${result}. That's how many times they've touched grass this year!"
    ],
    "high": [
      "${playerName} rolled a ${result}! They should try fighting Lord Jawbus with those odds!",
      "The dice bow to ${playerName}: ${result}! Now if only their damage was that high...",
      "${playerName} shakes the dice and gets a ${result}. Plot twist: it was actually their Catacombs level!",
      "${playerName} rolls a ${result}. That's it, we're nerfing dice rolls in the next patch.",
      "${playerName} rolled a ${result}! They should try fighting Thunders with those odds!",
      "The dice bows to ${playerName} with a ${result}! Even RNGesus is jealous.",
      "By some miracle, ${playerName}'s die landed on ${result}. Admins, we found your next nerf target!"
    ]
  },
  "8ballResponses": [
    "As certain as a Bonzo Staff nerf",
    "Outlook hazier than the Mist in Crystal Hollows",
    "My sources (aka random hub 1 players) say no",
    "You may rely on it (like you rely on your Hyperion)",
    "Ask again when Diana's event actually arrives",
    "Better not tell you now (or ever, I'm an 8-ball, not a quest guide)",
    "Cannot predict now, Magic 8-Ball is ironman and can't use /ah",
    "Don't count on it (like you shouldn't count on random F7 parties)",
    "It is decidedly so (unlike Hypixel's update schedule)",
    "Most likely (unlike your chances of dropping a Necron's Handle)",
    "My reply is no (like your coop members when you ask for coins)",
    "Outlook good (better than Skyblock's economy at least)",
    "Reply hazy, try again (like trying to snipe stuff on auction)",
    "Signs point to yes (but signs also point to the Toxic Sewers, so...)",
    "Very doubtful (like the existence of grass touchers in Skyblock)",
    "Without a doubt (unlike your skill in defeating Thunders)",
    "Yes (but actually no, like a Skyblock clickbait thumbnail)",
    "Yes definitely (as definite as the next duping method patch)",
    "You may rely on it (more than you can rely on Hypixel's servers)",
    "As I see it, yes (but I'm an 8-ball, so my vision is spherical and distorted)",
    "Ask again later (preferably after the next century cake)",
    "Concentrate and ask again (like you concentrate on not dying in M7)",
    "Don't bet on it (unless you're Marina simping)",
    "It is certain (as certain as lag in Hub 1)",
    "My sources say no (my sources being the Skyblock subreddit)",
    "Outlook not so good (like your chances of finding Melody without a quest marker)",
    "Very likely (unlike finding a lobby without 'quitting' players)",
    "Without a doubt (unlike your gameplay skills)",
    "As likely as finding Technoblade's crown",
    "Outlook hazier than the Howling Caves without Night Vision",
    "My sources (aka random non-ranked players) say no",
    "You may rely on it (like you rely on your AOTE)",
    "Ask again when Dante becomes a beloved mayor",
    "Better not tell you now (or ever, I'm an 8-ball, not a Skyblock Wiki)",
    "Cannot predict now, Magic 8-Ball is too busy grinding Skills",
    "Don't count on it (like you shouldn't count on good RNG)",
    "It is decidedly so (unlike the stability of Hypixel servers)",
    "Most likely (unlike your chances of dropping a handle)",
    "My reply is no (like the response to 'can we remove Foraging?')",
    "Outlook good (better than Skyblock's economy at least)",
    "Reply hazy, try again (like trying to snipe good deals on AH)",
    "Signs point to yes (but signs also point to the Fairy Soul you missed)",
    "Very doubtful (like the existence of a balanced Skyblock meta)",
    "Without a doubt (unlike your gameplay skills)",
    "Yes (but actually no, like a clickbait Skyblock video)",
    "Yes definitely (as definite as the next coin-making method nerf)",
    "You may rely on it (more than you can rely on Party Finder)",
    "As I see it, yes (but I'm an 8-ball, so my vision is spherical and distorted)",
    "Ask again later (preferably after the next century cake)",
    "Concentrate and ask again (like you concentrate on not dying in M7)",
    "Don't bet on it (unless you're a Marina simp)",
    "It is certain (as certain as lag in Hub 1)",
    "My sources say no (my sources being the Skyblock subreddit)",
    "Outlook not so good (like your chances of soloing Kuudra)",
    "Very likely (unlike finding a lobby without 'quitting' players)"
  ],
"simp": {
    "low": [
      "${playerName} is ${percentage}% simp. They wouldn't even donate to Marina's OnlyFins.",
      "With ${percentage}% simp energy, ${playerName} thinks 'Simp' is just a misspelling of 'Shrimp'.",
      "${playerName} is ${percentage}% simp. They'd rather farm potatoes than compliment an NPC.",
      "${percentage}% simp level for ${playerName}. They're more interested in Bazaar flipping than NPC flirting.",
      "At ${percentage}% simp, ${playerName} thinks Marina is just another fish in the sea."
    ],
    "medium": [
      "${playerName} is ${percentage}% simp. They occasionally say 'hi' to Elle.",
      "With a ${percentage}% simp rating, ${playerName} might buy flowers for Marina... if they're on sale.",
      "${playerName} scores ${percentage}% on the simp scale. They've considered changing their skin for an NPC... but didn't.",
      "${percentage}% simp energy radiates from ${playerName}. They've memorized half of Elle's dialogue... for efficiency, of course.",
      "At ${percentage}% simp, ${playerName} has thought about writing fanfic about Seymour... but decided to touch grass instead."
    ],
    "high": [
      "${playerName} is ${percentage}% simp! They've proposed to Marina with a maxed Giant Fishing Rod!",
      "Alert! ${playerName} has reached ${percentage}% simp levels! They're trying to unlock 'Marry NPC' feature!",
      "At ${percentage}% simp, ${playerName} has a shrine dedicated to Elle in their island's basement!",
      "${playerName} is ${percentage}% simp. They're practicing Melody's Harp songs to serenade the Hub NPCs!",
      "With ${percentage}% simp power, ${playerName} is writing a petition to make Marina the permanent mayor!"
    ]
  },
  "sus": {
    "low": [
      "${playerName} is ${percentage}% sus. Even the Impostor thinks they're trustworthy.",
      "${playerName} is ${percentage}% sus. They're about as suspicious as a Gaia Construct doing taxes.",
      "${percentage}% sus level for ${playerName}. They couldn't fool a Silverfish into thinking they're stone.",
      "At ${percentage}% sus, ${playerName} is less suspicious than a Lapis Zombie in The End."
    ],
    "medium": [
      "${playerName} is ${percentage}% sus. They've been seen whispering to Villagers a bit too often.",
      "With a ${percentage}% sus rating, ${playerName} might be hiding something... probably just some Enchanted Bread.",
      "${playerName} scores ${percentage}% on the sus scale. They've been spotted near the Auction House at odd hours.",
      "${percentage}% sus energy radiates from ${playerName}. Their island has a secret room... full of Aspect of the Jerrys.",
      "At ${percentage}% sus, ${playerName} claims they can get you a discount at the Dark Auction... seems legit."
    ],
    "high": [
      "${playerName} is ${percentage}% sus! Even Sven Packmaster is keeping an eye on them!",
      "Alert! ${playerName} has reached ${percentage}% sus levels! They're trying to convince people that Technoblade's potato crown was actually theirs!",
      "At ${percentage}% sus, ${playerName} claims they have a secret method to dupe Coins... by right-clicking Bankers really fast!",
      "${playerName} is ${percentage}% sus. They've been seen trying to sell 'Totally Legit Hyperion, Not Sculpted' in Hub 1!",
      "With ${percentage}% sus power, ${playerName} is more suspicious than a player with 'Totally Legit' in their IGN!"
    ]
  }
}